NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <stdbool.h>
// TODO: cleanup when done debugging
#define DEBUG
/* USER CODE END Includes */

/*
 * TODO list:
 * beamer hub: detect when new beamer is being connected, assign new ID and send it to the beamer
 * beamer hub: synchronize beamers with each other. send signals to each beamer when it is its turn to beam
 *
 * beamer: get ID, synchhronize time when initialize
 * beamer: start sending data on external signal
 *
 * receiver: signal when buffer with data frames is ready to be read from
 *
 * receiver hub: read from the buffer using spi&dma
 * receiver hub: send data to comp using usb / wifi / sockets
 * 4.
 * /

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
///TODO: refactor constants below
///TODO: learn about typedefs and structs
typedef struct
{
    uint8_t _1_beamer_id;
    uint8_t _2_angle_graycode;
    uint16_t _3_timer_cnt;
} DataFrame_t;

DataFrame_t rx_data_frame;
#define  RX_BUF_SIZE 10
DataFrame_t recent_data_frames_array[RX_BUF_SIZE];
uint8_t arr_index;

enum DataFrameStates
{
    DATAFRAME_0_NODATA,
    DATAFRAME_1_BEAMER_ID,
    DATAFRAME_2_ANGLE,
    DATAFRAME_3_TIME
};
volatile uint8_t DataFrameState = DATAFRAME_0_NODATA;

uint8_t rx_data = 0;
volatile size_t rx_total_bits = 0;
volatile uint8_t rx_current_byte_pos = 0;
volatile uint8_t rx_current_bit_pos = 0;
volatile uint8_t rx_bit = 0;

int level[100] = {0};
int pwm_period[100] = {0};
int pwm_length[100] = {0};
int pwm_index = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//TODO: specify timer constants
const uint16_t pwm_timer_prescaler = 0;
const uint16_t pwm_timer_period = 950 - 1;
const uint16_t pwm_pulse_width = 475;
const uint16_t envelop_timer_prescaler = 72 - 1;
//TODO: specify timer constants
// values below are numbers of timer ticks
const uint16_t PeriodOfDataBits = 2000 - 1;
const uint16_t PeriodBetweenDataFrames = 5000 - 1;
const uint16_t PeriodOfStartStopBits = 1000 - 1;
const uint16_t HalfPeriodOfStartStopBits = 500 - 1;
const uint16_t HalfPeriodOfDataBits = 1000 - 1;

enum ReceiverStates
{
    RX_WAITING_FOR_START_BIT,
    RX_START_BIT_PROCESSING,
    RX_START_BIT_DONE,
    RX_DATA_PROCESSNG,
    RX_DATA_DONE,
    RX_STOP_BIT_PROCESSING,
    RX_STOP_BIT_DONE
};
volatile uint8_t ReceiverState = RX_WAITING_FOR_START_BIT;

enum StartStopSequenceStates
{
    STAGE_0,
    STAGE_OFF0,
    STAGE_OFF0_ON1,
    STAGE_ON1,
    STAGE_ON1_OFF1,
    STAGE_OFF1,
    STAGE_OFF1_ON2,
    STAGE_ON2,
    STAGE_ON2_OFF2,
    STAGE_OFF2
};
volatile uint8_t StartStopSequenceReceiveState = STAGE_ON1;

const uint8_t max_delta_pwm = 10;
const uint8_t max_delta_pwm_width = 10;

// level 1
void receive_handler();
inline void reset_receiver_state();
inline bool is_rising_edge_confirmed();
inline bool is_falling_edge_confirmed();
inline bool is_high_level_confirmed();
inline bool is_low_level_confirmed();
inline bool is_timer_update();
inline bool is_rising_edge();

inline void receive_data_frame_part();
inline void p_w_demodulate(uint8_t bit);
inline void copy_data_frame_to_buffer(DataFrame_t* df);


inline void nop();

HAL_StatusTypeDef HAL_TIM_IC_PWM_Start_IT (TIM_HandleTypeDef *htim);

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  //MX_DMA_Init();
  //MX_I2C1_Init();
  //MX_SPI1_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();

  /* USER CODE BEGIN 2 */
  //HAL_TIM_Base_Start_IT(&htim3);
  //HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_2);
  HAL_TIM_IC_PWM_Start_IT(&htim4);
  /* USER CODE END 2 */

