NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
            }
            /// else - input capture, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_DATA_PROCESSNG:
        {
            if(is_timer_update())
            {
                receive_data_frame_part();
            }// end of is_timer_update()
            /// else - input capture during data receiving, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_DATA_DONE:
        {
            if(is_timer_update())
            {
                // wait for the middle of low level part of stop sequence
                // e.g. half of the delay before the first immpulse of stop bit sequence
                // after the delay
                //HAL_TIM_IC_PWM_Start_IT(&htim4); TODO
                htim3.Instance->ARR = HalfPeriodOfStartStopBits;
                ReceiverState = RX_STOP_BIT_PROCESSING;
                StartStopSequenceReceiveState = STAGE_OFF0;
                break;
            }
            /// else - input capture during data receiving, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_STOP_BIT_PROCESSING:
        {
            switch (StartStopSequenceReceiveState)
            {
                //low: off confirmation
                case STAGE_OFF0:
                {
                    if(is_low_level_confirmed())
                    {
                        // continue reading stop bit sequence with PeriodOfStartStopBits interval
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high rising edge: STAGE_OFF1 -> STAGE_ON1
                case STAGE_OFF0_ON1:
                {
                    // rising edge input capture
                    if(is_rising_edge_confirmed())
                    {
                        StartStopSequenceReceiveState = STAGE_ON1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high confirmation
                case STAGE_ON1:
                {
                    if(is_high_level_confirmed())
                    {
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //low falling edge: STAGE_ON1 -> STAGE_OFF1
                case STAGE_ON1_OFF1:
                {
                    if(is_falling_edge_confirmed())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low: confirmation
                case STAGE_OFF1:
                {
                    if(is_low_level_confirmed())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1_ON2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high rising edge: STAGE_OFF1 -> STAGE_ON2
                case STAGE_OFF1_ON2:
                {
                    // rising edge input capture
                    if(is_rising_edge_confirmed())
                    {
                         StartStopSequenceReceiveState = STAGE_ON2;
                         break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high confirmation
                case STAGE_ON2:
                {
                    // second pulse confrmation
                    if(is_high_level_confirmed())
                    {
                        StartStopSequenceReceiveState = STAGE_ON2_OFF2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low falling edge: STAGE_ON2 -> STAGE_OFFF2
                case STAGE_ON2_OFF2:
                {
                    if(is_falling_edge_confirmed())
                    {
                        ReceiverState = RX_STOP_BIT_DONE;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    reset_receiver_state();
                    break;
                }
                default:
                {
                    reset_receiver_state();
                    break;
                }
            }

            break;
        }
        case RX_STOP_BIT_DONE:
        {
            // immediately after stop sequence, line should be low
            // low confirmation
            if(is_low_level_confirmed())
            {
                // we successfully received data, send corresponding event for listeners to read from the data buffer
                // TODO
                copy_data_frame_to_buffer(&rx_data_frame);
            }
            reset_receiver_state();
            break;
        }
        default:
        {
            reset_receiver_state();
            break;
        }
    } // switch(ReceiverState)
}
void reset_receiver_state()
{
    ReceiverState = RX_WAITING_FOR_START_BIT;
    StartStopSequenceReceiveState = STAGE_0;
    HAL_TIM_Base_Stop_IT(&htim3);
}

bool is_rising_edge_confirmed()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            if(abs(htim4.Instance->CCR1 - PeriodOfStartStopBits) <  max_delta_pwm)
            {
                //TODO: ensure that abs is working
                return true;
            }
        }
    }
    return false;
}
bool is_falling_edge_confirmed()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC2) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC2) != RESET)
        {
            /*
            if(abs(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits) <  max_delta_pwm)
            {
                return true;
            }
            */
            if(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits < 0)
            {
                int delta = HalfPeriodOfStartStopBits - htim4.Instance->CCR2;
                if(HalfPeriodOfStartStopBits - htim4.Instance->CCR2 < max_delta_pwm)
                {
                    return true;
                }
            }
            else
            {
                int delta = htim4.Instance->CCR2 - HalfPeriodOfStartStopBits;
                if(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits < max_delta_pwm)
                {
                    return true;
                }
            }

