NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
        }
    }
    return false;
}
bool is_high_level_confirmed()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_low_level_confirmed()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_timer_update()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            return true;
        }
    }
    return false;
}
bool is_rising_edge()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            return true;
        }
    }
    return false;
}

void receive_data_frame_part()
{
    switch(DataFrameState)
    {
        default:
        {
            reset_receiver_state();
            return;
        }
        case(DATAFRAME_1_BEAMER_ID):
        {
            if(0 == rx_current_bit_pos) // execute only once, when first bit is being processed
            {
                // change period only when the very first bit of the whole data frame is being processed
                htim3.Instance->ARR = PeriodOfDataBits;
                rx_total_bits = sizeof(rx_data_frame._1_beamer_id) * 8;
            }
            // send current bit of current byte
            if(rx_current_bit_pos < rx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                {
                    // set bit at the inversed position
                    rx_data_frame._1_beamer_id |= 1 << (rx_total_bits - rx_current_bit_pos - 1);
                }
                /// no need to set bit to zero if signal is low, since all bits are initialized to zeros
                rx_current_bit_pos++;
            }
            // finished receiving, wait
            else if(rx_current_bit_pos == rx_total_bits)
            {
                // after each field in the data frame, there is a delay with
                // period PeriodOFDataBits, so need to wait, doing nothing in the meantime
                rx_current_bit_pos++;
            }
            // finished waiting, move to next state
            else
            {
                // change state to process second part of the data frame
                DataFrameState = DATAFRAME_2_ANGLE;
                // reset current bit position
                rx_current_bit_pos = 0;
            }
            break;
        }
        case(DATAFRAME_2_ANGLE):
        {
            if(0 == rx_current_bit_pos) // execute only once, when first bit is being processed
            {
                rx_total_bits = sizeof(rx_data_frame._2_angle_graycode) * 8;
            }
            // send current bit of current byte
            if(rx_current_bit_pos < rx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                {
                    // set bit at the inversed position
                    rx_data_frame._2_angle_graycode |= 1 << (rx_total_bits - rx_current_bit_pos - 1);
                }
                /// no need to set bit to zero if signal is low, since all bits are initialized to zeros
                rx_current_bit_pos++;
            }
            // finished receiving, wait
            else if(rx_current_bit_pos == rx_total_bits)
            {
                // after each field in the data frame, there is a delay with
                // period PeriodOFDataBits, so need to wait, doing nothing in the meantime
                rx_current_bit_pos++;
            }
            // finished waiting, move to next state
            else
            {
                // change state to process second part of the data frame
                DataFrameState = DATAFRAME_3_TIME;
                // reset current bit position
                rx_current_bit_pos = 0;
            }
            break;
        }
        case(DATAFRAME_3_TIME):
        {
            if(0 == rx_current_bit_pos) // execute only once, when first bit is being processed
            {
                rx_total_bits = sizeof(rx_data_frame._3_timer_cnt) * 8;
            }
            // send current bit of current byte
            if(rx_current_bit_pos < rx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                {
                    // set bit at the inversed position
                    rx_data_frame._3_timer_cnt |= 1 << (rx_total_bits - rx_current_bit_pos - 1);
                }
                /// no need to set bit to zero if signal is low, since all bits are initialized to zeros
                rx_current_bit_pos++;
            }
            /// finished receiving last field. No necessity to wait
            /// TODO: need to be on the same page with motionsensor_transmitter.
            /// At the moment, there is no delay after sending the verry last bit of the data frame
            else
            {
                // data has been received
                // TODO: process data buffer
                ReceiverState = RX_DATA_DONE;
                // wait for the end of data frame
                // e.g.remaining HalfPeriodOfDataBits before [the delay before] stop bit sequence
                htim3.Instance->ARR = HalfPeriodOfDataBits;
                //HAL_TIM_Base_Start_IT(&htim3);
                // reset state
                DataFrameState = DATAFRAME_0_NODATA;
                // reset current bit position
                rx_current_bit_pos = 0;
            }
            break;
        }
    }
}
void p_w_demodulate(uint8_t bit)
{

}
void copy_data_frame_to_buffer(DataFrame_t* df)
{
    recent_data_frames_array[arr_index]._2_angle_graycode = df->_2_angle_graycode;
    recent_data_frames_array[arr_index]._1_beamer_id = df->_1_beamer_id;
    recent_data_frames_array[arr_index]._3_timer_cnt = df->_3_timer_cnt;
    //memcpy(df, rx_data_frame_array, sizeof(rx_data_frame));
}

void nop(){}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
